{
  "Version": "1.0126",
  "ModID": "QuestsInsteadPreferred_Serp",
  "IncompatibleIds": null,
  "ModDependencies": null,
  "LoadAfterIds": ["*","Balanced_Trading_Serp","PreferredGoodsMerchants_Serp","CopyPools_CP_Preferred_Serp","CopyPools_CP_Products_Serp","NateInOldWorld_Serp","NewHorizons","new_horizons_languages","Community_Patch"],
  "Category": {
    "Chinese": "游戏玩法",
    "English": "Gameplay",
    "German": "Gameplay"
  },
  "ModName": {
    "English": "BT Quests Instead Preferred Goods (Serp)",
    "German": "BT Quests anstatt bevorzugte Waren (Serp)"
  },
  "Description": {
    "English": "Reduces Price-Bonus of all -Preferred Goods- from neutral merchants/pirates heavily. But instead the mod adds Trade Quests, which yields money for doing trades (resulting in better trade deals). This way you can only make limited profits with these requested goods and alot of exploits are removed: 1) no unlimited amount at high prices anymore, instead it will be like once per 45 minutes a limited amount. 2) Reduces the exploit with selling goods at high price to merchant and buying them back cheap (via passiv trading).",
    "German": "Reduziert den Preisvorteil von -bevorzugten Waren- neutraler Händler/Piraten drastisch. Stattdessen werden Handels-Quests zugefügt, die durch Geld als Belohnung indirekt für bessere Preise sorgen. Auf diese Weise wird der Umsatz für diese profitablen Trades limitiert, wodurch einige Exploits wegfallen: 1) Kein unlimitierter Verkauf mehr von Waren zu überhöhten Preisen, stattdessen durch die Quests limitiert auf 1 mal pro ~45 Minuten auf einen bestimmten Umsatz. 2) Schwächt dadurch auch den Exploit waren teuer an die Händler zu verkaufen, um sie danach im passivhandel günstiger wieder zurückzukaufen usw."
  },
  "KnownIssues": [
    {
      "English": null,
      "German": null
    }
  ],
  "DLCDependencies": null,
  "CreatorName": "Serp",
  "CreatorContact": "https://github.com/Serpens66",
  "ModioResourceId": 3403655,
  "changelog": {
    "1.0121" : "Add ModioResourceId to modinfo.json",
    "1.0122" : "Improve code a bit",
    "1.0123" : "Thanks 'Nils' for valuable feedback to my mods :)\n- For region specific quests, add condition that you have at least a ship in that region, before they can appear.\n- Make the Quests automatically start, since there is no downside for refusing them.",
    "1.0124" : "Fix error in new code to fetch all goods of a region introduced in 1.0123, now it counts them again correctly.",
    "1.0125" : "Make submod load after DisplayPassiveTradegoods_Serp so all goods offered are counted for the Quests.",
    "1.0126" : "Update submod for region specific goods,  using ProductionRegions now instead of AssociatedRegion to define which product 'belongs' to which region."
  }
}