{
  "Version": "1.01",
  "ModID": "DiplomacyExpansionSabotage_Serp",
  "IncompatibleIds": null,
  "ModDependencies": [],
  "LoadAfterIds": [
    "CycleShipSkins",
    "shared_TickActions_Serp"
  ],
  "Category": {
    "English": "Gameplay"
  },
  "ModName": {
    "English": "Diplomacy Expansion & Sabotage",
    "German": "Diplomatie Erweiterung & Sabotage"
  },
  "Description": {
    "English": "Diplomacy Expansion & Sabotage: Includes my mods: AI-P Free Beg CeaseFire (Serp), Shorter CeaseFire/NonAttack (Serp), DiploActions Embassy (Serp), P Reward Destroy Pirate (Serp), P Pirate Demands (Serp), Sabotage",
    "German": "Diplomatie Erweiterung & Sabotage: Beinhaltet meine Mods: AI-P Kostenloses Waffenstillstand Betteln (Serp), Kürzerer Waffenstillstand/NichtAngriff (Serp), DiploActions Botschaft (Serp), P Belohnung Piraten Vernichten (Serp), P Piraten Forderungen (Serp), Sabotage"
  },
  "KnownIssues": [
    {
      "English": "Never load and play with the first Autosave of a new game. It is heavily bugged and also causes problem for many of my mods."
    },
    {
      "English": "To better detect spies you can use Sonar, but if you dont own the SunkenTreasures DLC these detection-waves are not displayed."
    },
    {
      "English": "Commanding multiple Police Units at once: Voice is about being a fleet and they leave a huge gap between them and also patrol for them and spy is hard. I dont know a way to fix this."
    }
  ],
  "DLCDependencies": null,
  "CreatorName": "Serp",
  "CreatorContact": "https://github.com/Serpens66",
  "ModioResourceId": 5135448,
  "changelog": {
    "1.001" : "Add ModioResourceId and changelog to modinfo.json\nFix the bug that -change owner- did not work. Now gifting ships, selling/buying ships and getting control of support fleet should work like intended.",
    "1.002" : "Fix the bug that you were no longer able to buy a new flagship from neutral traders (my new code prevented it because flagship in general is not sellable, but in this case its intended to allow the buy..)",
    "1.01" : "Add English translation (thx LokiCharms).\n- Add my new mod -MoreInfoTooltipsNew_Serp-. In a future update you will be able to see cargo of ships from spied players (and now already from allied players).\n- New saboatage action: Add bad newspaper article to next newspaper (only makes sense against other humans)\n- Add a 'Quest' which spawns a AI spy on your island if Rep is below 40. If you dont find and eliminate the spy within 10 minutes, sabotage will happen: bad news, steal money or bad reputation. So unlike the other AI spies you will have a Quest for this which shows you the island and the spy will not shoot at your buildings, but move around and only after the timelimit the sabotage will happen.\n- several bugfixes:\n- - Fix explosion doing no damage\n- - Fix Easy setting to also properly reduce crafting time/costs in spy post building\n- - using UniqueType for the barracks (Kaserne) building now, instead of my previous unfortunately unreliable code. Once per island.\n- - Making the Participants Mercier and Pirates infectable by Incidents"
  }
}