{
  "Version": "1.06",
  "ModID": "PirateComebackFix_Serp",
  "IncompatibleIds": null,
  "LoadAfterIds": ["Stronger_Pirates_Serp","[Gameplay] 03 Combat Overhaul Pirates","military_attention_pirates","*","[Gameplay] 03 Combat Overhaul Pirates ","[Gameplay] 03 Combat Overhaul Pirates  ","[Gameplay] 03 Combat Overhaul Pirates   "],
  "ModDependencies": null,
  "Category": {
    "English": "BugFix",
    "German": "BugFix"
  },
  "ModName": {
    "English": "P Pirate ComebackFleet Fix (Serp)",
    "German": "P Pirate ComebackFleet Fix (Serp)"
  },
  "Description": {
    "English": "(also see piratecomebackfleetbugs.txt) Fixes some of the many bugs of the pirate comeback fleet: - Most major change you need to be aware: Pirate harbors are invincible now! Destroy all guns instead from pirate to defeat the pirates! - Comeback Fleet will no longer shoot at friends of pirates. - They will leave the map, just like normal warfleet ships, after the pirate was defeated again (this also means they wont stay at harbor doing nothing, after pirate resettled). - Normal warfleet also will leave map only after pirate is really defeated, not already when harbor is destryoed. - Save and loading the game while the pirates are resettling still aborts this quest and spawns another comebackfleet later, but this mod removes the current now useless fleet, to not result in 2 or more fleets at the same time. - When you were not at war with pirates while the comebackfleet arrives (eg. because AI destryoed them or you used pirate flag item to destroy base), then the background quests to resettle were never started and pirates never rebuilt. Bypass was to save+load, declare war and wait for the next fleet, this mod automatically declares war to the pirates after defeat for every human, to prevent the bug from happening. - The total amount of pirate ships at the same time is no longer increased over the intended max amount due to comebackfleet not counting towards this limit.",
    "German": "(seiehe auch piratecomebackfleetbugs.txt) Fixed ein paar der vielen Bugs der Piraten RückkehrFlotte: - Wichtigste Änderung: die Piratenhafen sind nun unverwundbar, zerstöre stattdessen alle Geschützstellungen der Piraten um sie zu besiegen!  - Sie schießen nicht länger auf Freunde des Piraten. - Sie verlassen die Karte, so wie normale Piratenschiffe, nachdem die Piraten erneut besiegt wurden (das heißt auch sie stehen nicht mehr ungenutzt am Hafen nachdem der Pirat zurückgekehrt ist). - Laden eines Savegames bei dem die Piraten gerade dabei sind zurückzukehren, beendet die Quest weiterhin und nach einiger Zeit erscheint eine zweite RückkehrFlotte, aber der Mod entfernt die aktuelle nun nutzlose Flotte, damit es später nicht 2 oder mehr Flotten aufeinmal sind. - Wenn man nicht im Krieg mit den Piraten war, während die Rückkehrflotte erscheint, dann starteten die Hintergrundquests nicht und sie bauten sich nicht wieder auf. Lösen konnte man das nur durch Speichern+Laden, Kriegserklärung und warten auf eine weitere Flotte, dieser Mod erklärt automatisch Krieg zwischen Piraten und menschlichen Spielern um den Bug zu verhindern. - Die RückkehrFlotte zählt nun zur maximalen Schiffsanzahl der Warfleet, wodurch die Piraten nicht mehr mehr Schiffe haben können, als eigentlich vorgesehen. - Übrige Piratenschiffe verlassen erst die Karte wenn der Pirat komplett zerstört wurde, nicht schon wenn nur der Hafen zerstört ist."
  },
  "KnownIssues": [
    {
      "English": "The bugged code is not accessable for modders, so this is no real fix unfortunately. It is code to work around the bugs.",
      "German": "der verbuggte vanilla code ist leider nicht modbar/einsehbar, weshalb dieser Mod nur ein bestmöglicher workaround ist."
    }
  ],
  "DLCDependencies": null,
  "CreatorName": "Serp",
  "CreatorContact": "https://github.com/Serpens66"
}